{"kind":"ServiceIntentions","apiVersion":"consul.hashicorp.com/v1alpha1","display-name":"Service Intentions","format":"JSON","metadata":{},"model":{"name":"CONSUL","version":"v1.0.3","display-name":"CONSUL","category":"Orchestration \u0026 Management","sub-category":"Service Mesh"},"schema":"{\n \"description\": \"ServiceIntentionsSpec defines the desired state of ServiceIntentions.\",\n \"properties\": {\n  \"destination\": {\n   \"description\": \"Destination is the intention destination that will have the authorization granted to.\",\n   \"properties\": {\n    \"name\": {\n     \"description\": \"Name is the destination of all intentions defined in this config entry. This may be set to the wildcard character (*) to match all services that don't otherwise have intentions defined.\",\n     \"type\": \"string\"\n    },\n    \"namespace\": {\n     \"description\": \"Namespace specifies the namespace the config entry will apply to. This may be set to the wildcard character (*) to match all services in all namespaces that don't otherwise have intentions defined.\",\n     \"type\": \"string\"\n    }\n   },\n   \"type\": \"object\"\n  },\n  \"sources\": {\n   \"description\": \"Sources is the list of all intention sources and the authorization granted to those sources. The order of this list does not matter, but out of convenience Consul will always store this reverse sorted by intention precedence, as that is the order that they will be evaluated at enforcement time.\",\n   \"items\": {\n    \"properties\": {\n     \"action\": {\n      \"description\": \"Action is required for an L4 intention, and should be set to one of \\\"allow\\\" or \\\"deny\\\" for the action that should be taken if this intention matches a request.\",\n      \"type\": \"string\"\n     },\n     \"description\": {\n      \"description\": \"Description for the intention. This is not used by Consul, but is presented in API responses to assist tooling.\",\n      \"type\": \"string\"\n     },\n     \"name\": {\n      \"description\": \"Name is the source of the intention. This is the name of a Consul service. The service doesn't need to be registered.\",\n      \"type\": \"string\"\n     },\n     \"namespace\": {\n      \"description\": \"Namespace is the namespace for the Name parameter.\",\n      \"type\": \"string\"\n     },\n     \"partition\": {\n      \"description\": \"Partition is the Admin Partition for the Name parameter.\",\n      \"type\": \"string\"\n     },\n     \"peer\": {\n      \"description\": \"[Experimental] Peer is the peer name for the Name parameter.\",\n      \"type\": \"string\"\n     },\n     \"permissions\": {\n      \"description\": \"Permissions is the list of all additional L7 attributes that extend the intention match criteria. Permission precedence is applied top to bottom. For any given request the first permission to match in the list is terminal and stops further evaluation. As with L4 intentions, traffic that fails to match any of the provided permissions in this intention will be subject to the default intention behavior is defined by the default ACL policy. This should be omitted for an L4 intention as it is mutually exclusive with the Action field.\",\n      \"items\": {\n       \"properties\": {\n        \"action\": {\n         \"description\": \"Action is one of \\\"allow\\\" or \\\"deny\\\" for the action that should be taken if this permission matches a request.\",\n         \"type\": \"string\"\n        },\n        \"http\": {\n         \"description\": \"HTTP is a set of HTTP-specific authorization criteria.\",\n         \"properties\": {\n          \"header\": {\n           \"description\": \"Header is a set of criteria that can match on HTTP request headers. If more than one is configured all must match for the overall match to apply.\",\n           \"items\": {\n            \"properties\": {\n             \"exact\": {\n              \"description\": \"Exact matches if the header with the given name is this value.\",\n              \"type\": \"string\"\n             },\n             \"invert\": {\n              \"description\": \"Invert inverts the logic of the match.\",\n              \"type\": \"boolean\"\n             },\n             \"name\": {\n              \"description\": \"Name is the name of the header to match.\",\n              \"type\": \"string\"\n             },\n             \"prefix\": {\n              \"description\": \"Prefix matches if the header with the given name has this prefix.\",\n              \"type\": \"string\"\n             },\n             \"present\": {\n              \"description\": \"Present matches if the header with the given name is present with any value.\",\n              \"type\": \"boolean\"\n             },\n             \"regex\": {\n              \"description\": \"Regex matches if the header with the given name matches this pattern.\",\n              \"type\": \"string\"\n             },\n             \"suffix\": {\n              \"description\": \"Suffix matches if the header with the given name has this suffix.\",\n              \"type\": \"string\"\n             }\n            },\n            \"type\": \"object\"\n           },\n           \"type\": \"array\"\n          },\n          \"methods\": {\n           \"description\": \"Methods is a list of HTTP methods for which this match applies. If unspecified all HTTP methods are matched. If provided the names must be a valid method.\",\n           \"items\": {\n            \"type\": \"string\"\n           },\n           \"type\": \"array\"\n          },\n          \"pathExact\": {\n           \"description\": \"PathExact is the exact path to match on the HTTP request path.\",\n           \"type\": \"string\"\n          },\n          \"pathPrefix\": {\n           \"description\": \"PathPrefix is the path prefix to match on the HTTP request path.\",\n           \"type\": \"string\"\n          },\n          \"pathRegex\": {\n           \"description\": \"PathRegex is the regular expression to match on the HTTP request path.\",\n           \"type\": \"string\"\n          }\n         },\n         \"type\": \"object\"\n        }\n       },\n       \"type\": \"object\"\n      },\n      \"type\": \"array\"\n     }\n    },\n    \"type\": \"object\"\n   },\n   \"type\": \"array\"\n  }\n },\n \"title\": \"Service Intentions\",\n \"type\": \"object\"\n}"}