{"kind":"ProxyDefaults","apiVersion":"consul.hashicorp.com/v1alpha1","displayName":"Proxy Defaults","format":"JSON","metadata":{},"model":{"name":"CONSUL","version":"v1.0.2","displayName":"CONSUL","category":"Orchestration \u0026 Management","subCategory":"Service Mesh"},"schema":"{\n \"description\": \"ProxyDefaultsSpec defines the desired state of ProxyDefaults.\",\n \"properties\": {\n  \"config\": {\n   \"description\": \"Config is an arbitrary map of configuration values used by Connect proxies. Any values that your proxy allows can be configured globally here. Supports JSON config values. See https://www.consul.io/docs/connect/proxies/envoy#configuration-formatting\",\n   \"type\": \"object\",\n   \"x-kubernetes-preserve-unknown-fields\": true\n  },\n  \"expose\": {\n   \"description\": \"Expose controls the default expose path configuration for Envoy.\",\n   \"properties\": {\n    \"checks\": {\n     \"description\": \"Checks defines whether paths associated with Consul checks will be exposed. This flag triggers exposing all HTTP and GRPC check paths registered for the service.\",\n     \"type\": \"boolean\"\n    },\n    \"paths\": {\n     \"description\": \"Paths is the list of paths exposed through the proxy.\",\n     \"items\": {\n      \"properties\": {\n       \"listenerPort\": {\n        \"description\": \"ListenerPort defines the port of the proxy's listener for exposed paths.\",\n        \"type\": \"integer\"\n       },\n       \"localPathPort\": {\n        \"description\": \"LocalPathPort is the port that the service is listening on for the given path.\",\n        \"type\": \"integer\"\n       },\n       \"path\": {\n        \"description\": \"Path is the path to expose through the proxy, ie. \\\"/metrics\\\".\",\n        \"type\": \"string\"\n       },\n       \"protocol\": {\n        \"description\": \"Protocol describes the upstream's service protocol. Valid values are \\\"http\\\" and \\\"http2\\\", defaults to \\\"http\\\".\",\n        \"type\": \"string\"\n       }\n      },\n      \"type\": \"object\"\n     },\n     \"type\": \"array\"\n    }\n   },\n   \"type\": \"object\"\n  },\n  \"meshGateway\": {\n   \"description\": \"MeshGateway controls the default mesh gateway configuration for this service.\",\n   \"properties\": {\n    \"mode\": {\n     \"description\": \"Mode is the mode that should be used for the upstream connection. One of none, local, or remote.\",\n     \"type\": \"string\"\n    }\n   },\n   \"type\": \"object\"\n  },\n  \"mode\": {\n   \"description\": \"Mode can be one of \\\"direct\\\" or \\\"transparent\\\". \\\"transparent\\\" represents that inbound and outbound application traffic is being captured and redirected through the proxy. This mode does not enable the traffic redirection itself. Instead it signals Consul to configure Envoy as if traffic is already being redirected. \\\"direct\\\" represents that the proxy's listeners must be dialed directly by the local application and other proxies. Note: This cannot be set using the CRD and should be set using annotations on the services that are part of the mesh.\",\n   \"type\": \"string\"\n  },\n  \"transparentProxy\": {\n   \"description\": \"TransparentProxy controls configuration specific to proxies in transparent mode. Note: This cannot be set using the CRD and should be set using annotations on the services that are part of the mesh.\",\n   \"properties\": {\n    \"dialedDirectly\": {\n     \"description\": \"DialedDirectly indicates whether transparent proxies can dial this proxy instance directly. The discovery chain is not considered when dialing a service instance directly. This setting is useful when addressing stateful services, such as a database cluster with a leader node.\",\n     \"type\": \"boolean\"\n    },\n    \"outboundListenerPort\": {\n     \"description\": \"OutboundListenerPort is the port of the listener where outbound application traffic is being redirected to.\",\n     \"type\": \"integer\"\n    }\n   },\n   \"type\": \"object\"\n  }\n },\n \"title\": \"Proxy Defaults\",\n \"type\": \"object\"\n}"}